Revit 2027 API
Floor.GetSpanDirectionSymbolIds Method
Retrieves span direction symbol ElementIds.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetSpanDirectionSymbolIds()
Public Function GetSpanDirectionSymbolIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetSpanDirectionSymbolIds()
member GetSpanDirectionSymbolIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
A collection of Element Ids of span direction symbol elements
Remarks
The element types of the Ids of these symbols determine if the floor has one way or two way span direction graphics.
See Also
Reference
Floor Class
Autodesk.Revit.DB Namespace